Revit 2027 API
MacroModuleIterator.Reset Method
 Resets the iterator to the initial state.
Namespace: Autodesk.Revit.DB.Macros
Assembly: RevitAPIMacros (in RevitAPIMacros.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual void Reset()
Public Overridable Sub Reset
public:
virtual void Reset()
abstract Reset : unit -> unit
override Reset : unit -> unit
See Also
Reference
MacroModuleIterator Class
Autodesk.Revit.DB.Macros Namespace